Tekla Open API Reference for Tekla Structures 2025
AnalysisEdge.AddSplit Method
 Adds a split position to the analysis edge.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void AddSplit(
	AnalysisPosition AnalysisPosition
)
Public Sub AddSplit (
	AnalysisPosition As AnalysisPosition
)
Parameters
AnalysisPosition
Type: Tekla.Structures.Analysis.AnalysisPosition
The split position to be added.
See Also
Reference
AnalysisEdge Class
Tekla.Structures.Analysis Namespace